Publ/Teoria/DataStruct/Queues.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2022-01-30 Sun 21:51 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Queues</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Dicusión sobre Queues</a></li>
<li><a href="#sec-1-2">1.2. Detalles de implementación</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Queues</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="file:///TOC/">file:///TOC/</a>
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Dicusión sobre Queues</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> ¿Que es una Queue?</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Es una estructura de datos lineal que modela una cola del mundo real. Tiene dos
operaciónes primarias <i>enqueue</i> y <i>dequeue</i>.
</p>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Terminologia</h4>
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
  graph LR
      subgraph queue
      id1[( )]    
      id2[( )]
      id3[( )]
      end
      id1 --Dequeue--&gt; id0[( )]
      id4[( )] --Enqueue--&gt; id3
</pre>

<ul class="org-ul">
<li>Añadir elementos al final de la cola se le llama <i>Enqueue</i>
</li>
<li>Remover elementos de el inicio de la cola se le llama <i>Dequeue</i> &gt; No
hay una manera consistent de llamar a la terminologia &gt; &gt; Enqueue =
Adding = Offering &gt; &gt; Dequueue = Polling
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> ¿Cúando y dónde son usadas?</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>Cualquier cosa que pueda ser modelada con una cola, como por ejemplo
la cola para comprar boletos del cine
</li>
<li>Pueden ser usadas para hacer seguimiento de manera eficiente de los
últimos x elementos agregados.
</li>
<li>Breadth first search (BFS) graph traversal.
### Análisis de complejidad
</li>
</ul>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left">Operation</td>
<td class="text-left">Complexity</td>
</tr>

<tr>
<td class="text-left">:&#x2014;:</td>
<td class="text-left">:&#x2014;:</td>
</tr>

<tr>
<td class="text-left">Enqueue</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Dequeue</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Peeking</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Contains</td>
<td class="text-left">\(`O(n)`\)</td>
</tr>

<tr>
<td class="text-left">Removal</td>
<td class="text-left">\(`O(n)`\)</td>
</tr>

<tr>
<td class="text-left">Is empty</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Ejemplo</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Siendo la cola.
</p>

<pre class="example">
  graph TD
      subgraph queue
      id1[(55)]   
      id2[(-1)]
      id3[(33)]
      id4[(17)] 
      id4[(11)] 
      end 
</pre>

<ul class="org-ul">
<li><code>Enqueue(12)</code>
</li>
</ul>

<pre class="example">
  graph TD
      subgraph queue
      id1[(55)]   
      id2[(-1)]
      id3[(33)]
      id4[(17)] 
      id4[(11)] 
      id5[(12)]
      end 
</pre>

<ul class="org-ul">
<li><code>Dequeue()</code>
</li>
</ul>

<pre class="example">
  graph TD
      subgraph queue
      id2[(-1)]
      id3[(33)]
      id4[(17)] 
      id4[(11)] 
      id5[(52)]
      end 
</pre>

<ul class="org-ul">
<li><code>Dequeue()</code>
</li>
</ul>

<pre class="example">
  graph TD
      subgraph queue
      id3[(33)]
      id4[(17)] 
      id4[(11)] 
      id5[(52)]
      end 
</pre>

<ul class="org-ul">
<li><code>Enqueue(7)</code>
</li>
</ul>

<pre class="example">
  graph TD
      subgraph queue
      id3[(33)]
      id4[(17)] 
      id4[(11)] 
      id5[(52)]
      id6[(7)]
      end 
</pre>
</div>

<ol class="org-ol"><li><a id="sec-1-1-4-1" name="sec-1-1-4-1"></a>Queue Breadth First Search (BFS)<br ><div class="outline-text-5" id="text-1-1-4-1">
<pre class="example">
  flowchart LR
      id1((0)) &lt;--&gt; id2((1)) &lt;--&gt; id3((8)) &lt;--&gt; id4((9)) &lt;--&gt; id1
      id5((12))
      id6((7)) &lt;--&gt; id3 
      id6 &lt;--&gt; id7((10))
      id81((11)) &lt;--&gt; id6
      id6 &lt;--&gt; id8((6)) &lt;--&gt; id9((5))
      id6 &lt;--&gt; id10((3)) &lt;--&gt; id11((4))
      id10 &lt;--&gt; id12((2))

      subgraph Siendo:
      id21((unvisited))
      id22[On the frontier]
      id23[(visited)]
      end
</pre>

<p>
El objetivo es empezar en un nodo y atravezar todo el grafo, empezando
por visitar todos los vecinos de el nodo inicial e interando sobre este
concepto.
</p>

<pre class="example">
  flowchart LR
      id1[(0)] &lt;--&gt; id2[1] &lt;--&gt; id3((8)) &lt;--&gt; id4[9] &lt;--&gt; id1
      id5((12))
      id6((7)) &lt;--&gt; id3 
      id6 &lt;--&gt; id7((10))
      id81((11)) &lt;--&gt; id6
      id6 &lt;--&gt; id8((6)) &lt;--&gt; id9((5))
      id6 &lt;--&gt; id10((3)) &lt;--&gt; id11((4))
      id10 &lt;--&gt; id12((2))
</pre>

<pre class="example">
  flowchart LR
      id1[(0)] &lt;--&gt; id2[(1)] &lt;--&gt; id3[8] &lt;--&gt; id4[(9)] &lt;--&gt; id1
      id5((12))
      id6((7)) &lt;--&gt; id3 
      id6 &lt;--&gt; id7((10))
      id81((11)) &lt;--&gt; id6
      id6 &lt;--&gt; id8((6)) &lt;--&gt; id9((5))
      id6 &lt;--&gt; id10((3)) &lt;--&gt; id11((4))
      id10 &lt;--&gt; id12((2))
</pre>

<pre class="example">
  flowchart LR
      id1[(0)] &lt;--&gt; id2[(1)] &lt;--&gt; id3[(8)] &lt;--&gt; id4[(9)] &lt;--&gt; id1
      id5((12))
      id6[7] &lt;--&gt; id3 
      id6 &lt;--&gt; id7((10))
      id81((11)) &lt;--&gt; id6
      id6 &lt;--&gt; id8((6)) &lt;--&gt; id9((5))
      id6 &lt;--&gt; id10((3)) &lt;--&gt; id11((4))
      id10 &lt;--&gt; id12((2))
</pre>

<pre class="example">
  flowchart LR
      id1[(0)] &lt;--&gt; id2[(1)] &lt;--&gt; id3[(8)] &lt;--&gt; id4[(9)] &lt;--&gt; id1
      id5((12))
      id6[(7)] &lt;--&gt; id3 
      id6 &lt;--&gt; id7[10]
      id81[11] &lt;--&gt; id6
      id6 &lt;--&gt; id8[6] &lt;--&gt; id9((5))
      id6 &lt;--&gt; id10[3] &lt;--&gt; id11((4))
      id10 &lt;--&gt; id12((2))
</pre>
</div>

<ol class="org-ol"><li><a id="sec-1-1-4-1-1" name="sec-1-1-4-1-1"></a>Implementación en código<br ><div class="outline-text-6" id="text-1-1-4-1-1">
<pre class="example">
  Let Q be a Queue
  Q.enqueue(starting_node)
  starting_node.visited = true

  While Q is not empty Do

      node = Q.dequeue()

      For neighbour in neighbours(node):
          If neighbour has not been visitated:
              neighbour.visitated = true
              Q.endqueue(neighbour)
</pre>
</div>
</li></ol>
</li></ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Detalles de implementación</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Se puede inmplementar una cola en diferentes maneras, pero las más
populares son implementarlas usando arrays, SLL o DLL.
</p>

<p>
Usalmente se usa un puntero para llevar un seguimiento de la cabeza y la
cola de la lista, y al agregar o quitar elementos solo movemos el
punrtero a la izquierda o a la derecha. ## Implementación en código
</p>

<div class="org-src-container">

<pre class="src src-java">  <span style="color: #ff79c6; font-style: italic;">package</span> com.williamfiset.algorithms.datastructures.queue;

  <span style="color: #6272a4; font-style: italic;">/**</span>
<span style="color: #6272a4; font-style: italic;">   * Besides the Generics, the loss of property of size is another difference between ArrayQueue and</span>
<span style="color: #6272a4; font-style: italic;">   * IntQueue. The size of ArrayQueue is calculated by the formula, as are empty status and full</span>
<span style="color: #6272a4; font-style: italic;">   * status.</span>
<span style="color: #6272a4; font-style: italic;">   *</span>
<span style="color: #6272a4; font-style: italic;">   * &lt;p&gt;ArrayQueue maximum size is data.length - 1. The place of the variable rear is always in front</span>
<span style="color: #6272a4; font-style: italic;">   * of the variable front logistically if regard the data array as circular. so the number of states</span>
<span style="color: #6272a4; font-style: italic;">   * of the combination of rear and front is the length of the data array. And one of the total states</span>
<span style="color: #6272a4; font-style: italic;">   * is used to be the judge if the queue is empty or full.</span>
<span style="color: #6272a4; font-style: italic;">   *</span>
<span style="color: #6272a4; font-style: italic;">   * @author liujingkun, liujkon@gmail.com</span>
<span style="color: #6272a4; font-style: italic;">   */</span>
  <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">class</span> <span style="color: #bd93f9;">ArrayQueue</span><span style="color: #61bfff;">&lt;</span><span style="color: #8be9fd;">T</span><span style="color: #61bfff;">&gt;</span> <span style="color: #ff79c6; font-style: italic;">implements</span> <span style="color: #bd93f9;">Queue</span><span style="color: #61bfff;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #61bfff;">&gt;</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #bd93f9;">Object</span><span style="color: #ff79c6;">[]</span> data;
    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #ffb86c;">int</span> front;
    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #ffb86c;">int</span> rear;

    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">ArrayQueue</span><span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">int</span> capacity<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #6272a4; font-style: italic;">// ArrayQueue maximum size is data.length - 1.</span>
      data = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">Object</span><span style="color: #50fa7b;">[</span>capacity + <span style="color: #8be9fd;">1</span><span style="color: #50fa7b;">]</span>;
      front = <span style="color: #8be9fd;">0</span>;
      rear = <span style="color: #8be9fd;">0</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">void</span> <span style="color: #50fa7b;">offer</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">T</span> elem<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isFull</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">RuntimeException</span><span style="color: #bd93f9;">(</span><span style="color: #f1fa8c;">"Queue is full"</span><span style="color: #bd93f9;">)</span>;
      <span style="color: #50fa7b;">}</span>
      data<span style="color: #50fa7b;">[</span>rear++<span style="color: #50fa7b;">]</span> = elem;
      rear = <span style="color: #50fa7b;">adjustIndex</span><span style="color: #50fa7b;">(</span>rear, data.length<span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
    <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">SuppressWarnings</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"unchecked"</span><span style="color: #ff79c6;">)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">poll</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">RuntimeException</span><span style="color: #bd93f9;">(</span><span style="color: #f1fa8c;">"Queue is empty"</span><span style="color: #bd93f9;">)</span>;
      <span style="color: #50fa7b;">}</span>
      front = <span style="color: #50fa7b;">adjustIndex</span><span style="color: #50fa7b;">(</span>front, data.length<span style="color: #50fa7b;">)</span>;
      <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #50fa7b;">(</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">)</span> data<span style="color: #50fa7b;">[</span>front++<span style="color: #50fa7b;">]</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
    <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">SuppressWarnings</span><span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"unchecked"</span><span style="color: #ff79c6;">)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">peek</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">RuntimeException</span><span style="color: #bd93f9;">(</span><span style="color: #f1fa8c;">"Queue is empty"</span><span style="color: #bd93f9;">)</span>;
      <span style="color: #50fa7b;">}</span>
      front = <span style="color: #50fa7b;">adjustIndex</span><span style="color: #50fa7b;">(</span>front, data.length<span style="color: #50fa7b;">)</span>;
      <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #50fa7b;">(</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">)</span> data<span style="color: #50fa7b;">[</span>front<span style="color: #50fa7b;">]</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">int</span> <span style="color: #50fa7b;">size</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #50fa7b;">adjustIndex</span><span style="color: #50fa7b;">(</span>rear + data.length - front, data.length<span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">boolean</span> <span style="color: #50fa7b;">isEmpty</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> rear == front;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">boolean</span> <span style="color: #50fa7b;">isFull</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #50fa7b;">(</span>front + data.length - rear<span style="color: #50fa7b;">)</span> % data.length == <span style="color: #8be9fd;">1</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #ffb86c;">int</span> <span style="color: #50fa7b;">adjustIndex</span><span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">int</span> index, <span style="color: #ffb86c;">int</span> size<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> index &gt;= size ? index - size : index;
    <span style="color: #ff79c6;">}</span>
  <span style="color: #61bfff;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2022-01-30 Sun 21:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
